<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Stakeholder;
class StakeholderSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $stakeholders = array(
            array('id' => '1','name' => 'إدارة تصميم مشاريع الشبكات والمنشآت المائية','created_at' => '2024-04-15 10:31:30','updated_at' => '2024-04-16 08:57:13'),
            array('id' => '2','name' => 'إدارة مشاريع المياه الجوفية','created_at' => '2024-04-15 10:32:00','updated_at' => '2024-04-15 10:32:00'),
            array('id' => '3','name' => 'إدارة الدراسات وبحوث المياه الجوفية','created_at' => '2024-04-15 10:32:26','updated_at' => '2024-04-15 10:32:26'),
            array('id' => '4','name' => 'إدارة مشاريع شبكات الوقود','created_at' => '2024-04-15 10:32:48','updated_at' => '2024-04-15 10:32:48'),
            array('id' => '5','name' => 'إدارة مشاريع المنشآت المائية','created_at' => '2024-04-15 10:33:29','updated_at' => '2024-04-15 10:33:29'),
            array('id' => '6','name' => 'إدارة مشاريع شبكات المياه','created_at' => '2024-04-15 10:35:13','updated_at' => '2024-04-15 10:35:13'),
            array('id' => '7','name' => 'الوكيل المساعد لمشاريع المياه','created_at' => '2024-04-15 10:37:09','updated_at' => '2024-04-15 10:37:09'),
            array('id' => '8','name' => 'الوكيل المساعد للشؤون المالية','created_at' => '2024-04-15 10:37:43','updated_at' => '2024-04-15 10:37:43'),
            array('id' => '9','name' => 'الوكيل المساعد للتخطيط والتدريب ونظم المعلومات','created_at' => '2024-04-15 10:38:13','updated_at' => '2024-04-15 10:38:13'),
            array('id' => '10','name' => 'الوكيل المساعد لشبكات التوزيع الكهربائية','created_at' => '2024-04-15 10:38:34','updated_at' => '2024-04-15 10:38:34'),
            array('id' => '11','name' => 'الوكيل المساعد لشبكات النقل الكهربائية','created_at' => '2024-04-15 10:38:56','updated_at' => '2024-04-15 10:38:56'),
            array('id' => '12','name' => 'الوكيل المساعد لخدمات العملاء','created_at' => '2024-04-15 10:39:11','updated_at' => '2024-04-15 10:39:11'),
            array('id' => '13','name' => 'الوكيل المساعد لمحطات القوي الكهربائية وتقطير المياه','created_at' => '2024-04-15 10:39:37','updated_at' => '2024-04-15 10:39:37'),
            array('id' => '14','name' => 'الوكيل المساعد لتشغيل وصيانة المياه','created_at' => '2024-04-15 10:39:57','updated_at' => '2024-04-15 10:39:57'),
            array('id' => '15','name' => 'الوكيل المساعد للخدمات الفنية والمشاغل الرئيسية','created_at' => '2024-04-15 10:40:25','updated_at' => '2024-04-15 10:40:25'),
            array('id' => '16','name' => 'الوكيل المساعد لمراكز المراقبة والتحكم والرقابة','created_at' => '2024-04-15 10:41:06','updated_at' => '2024-04-15 10:41:06'),
            array('id' => '17','name' => 'الوكيل المساعد للشؤون الادارية','created_at' => '2024-04-15 10:41:24','updated_at' => '2024-04-15 10:41:24'),
            array('id' => '18','name' => 'وكيل وزارة الكهرباء والماء والطاقة المتجددة','created_at' => '2024-04-15 10:43:26','updated_at' => '2024-04-15 10:43:26'),
            array('id' => '19','name' => 'دار الهندسة للتصميم والاستشارات الفنية (شاعر ومشاركوه) ','created_at' => '2024-04-15 10:45:20','updated_at' => '2024-04-15 10:45:20'),
            array('id' => '20','name' => 'إدارة الاتصالات','created_at' => '2024-07-08 13:14:55','updated_at' => '2024-07-08 13:14:55'),
            array('id' => '21','name' => 'وكيل وزارة الداخلية','created_at' => '2024-07-09 09:03:31','updated_at' => '2024-07-09 09:03:31'),
            array('id' => '22','name' => 'وكيل وزارة الاشغال العامة','created_at' => '2024-07-09 10:13:12','updated_at' => '2024-07-09 10:13:12'),
            array('id' => '23','name' => 'SMEC','created_at' => '2024-07-09 10:34:10','updated_at' => '2024-07-09 10:34:10'),
            array('id' => '24','name' => 'إدارة تشغيل وصيانة الشبكات المائية','created_at' => '2024-07-09 10:42:37','updated_at' => '2024-07-09 10:42:37'),
            array('id' => '25','name' => 'رئيس الفريق المشكل بالقرار الوزاري رقم 2023/233','created_at' => '2024-07-09 10:53:45','updated_at' => '2024-07-09 10:53:45'),
            array('id' => '26','name' => 'مدير عام المؤسسة العامة للرعاية السكنية','created_at' => '2024-07-09 10:59:43','updated_at' => '2024-07-09 10:59:43'),
            array('id' => '27','name' => 'الأمين العام للجهاز المركزي للمناقصات العامة','created_at' => '2024-07-09 11:06:24','updated_at' => '2024-07-09 11:06:24'),
            array('id' => '28','name' => 'مدير عام الهيئة العامة للطرق والنقل البري','created_at' => '2024-07-09 11:13:22','updated_at' => '2024-07-09 11:13:22'),
            array('id' => '29','name' => 'الهيئة العامة لشئون الزراعة والثروة السمكية','created_at' => '2024-07-09 11:16:55','updated_at' => '2024-07-09 11:16:55'),
            array('id' => '30','name' => ' إدارة التصميم والاشراف','created_at' => '2024-07-09 11:18:56','updated_at' => '2024-07-09 11:18:56'),
            array('id' => '31','name' => 'الهيئة العامة للمعلومات المدنية','created_at' => '2024-07-09 11:22:57','updated_at' => '2024-07-09 11:22:57'),
            array('id' => '32','name' => 'مدير عام بلدية الكويت','created_at' => '2024-07-09 11:24:54','updated_at' => '2024-07-09 11:24:54'),
            array('id' => '33','name' => 'إدارة تشغيل وصيانة المنشآت المائية','created_at' => '2024-07-09 12:45:44','updated_at' => '2024-07-09 12:45:44'),
            array('id' => '34','name' => 'شركة الصناعات الهندسية الثقيلة وبناء السفن (HEISCO)','created_at' => '2024-07-09 12:57:09','updated_at' => '2025-03-04 21:02:29'),
            array('id' => '35','name' => 'إدارة طوارئ الديزل','created_at' => '2024-07-09 13:00:34','updated_at' => '2024-07-09 13:00:34'),
            array('id' => '36','name' => 'إدارة شبكات التوزيع الكهربائية','created_at' => '2024-07-09 13:07:23','updated_at' => '2024-07-09 13:07:23'),
            array('id' => '37','name' => ' إدارة الأعمال الكيماوية','created_at' => '2024-07-09 13:17:23','updated_at' => '2024-07-09 13:17:23'),
            array('id' => '38','name' => 'إدارة إنارة الشوارع (قطاع شبكات التوزيع الكهربائية)','created_at' => '2024-07-09 13:59:57','updated_at' => '2024-08-05 13:16:20'),
            array('id' => '39','name' => 'إدارة إنتاج المياه الجوفية','created_at' => '2024-07-09 14:02:01','updated_at' => '2024-07-09 14:02:01'),
            array('id' => '40','name' => 'إدارة تصميم الشبكات الكهربائية (قطاع شبكات النقل الكهربائية)','created_at' => '2024-07-10 07:35:29','updated_at' => '2024-08-05 13:10:30'),
            array('id' => '41','name' => 'إدارة مشاريع الشبكات المائية','created_at' => '2024-07-10 07:40:41','updated_at' => '2024-07-10 07:40:41'),
            array('id' => '42','name' => 'الأمانة العامة للمجلس الأعلى للتخطيط والتنمية','created_at' => '2024-07-10 09:24:14','updated_at' => '2024-07-10 09:24:14'),
            array('id' => '43','name' => 'إدارة شؤون العاملين','created_at' => '2024-07-10 09:37:19','updated_at' => '2024-07-10 09:37:19'),
            array('id' => '44','name' => 'الأمين العام لمجلس الوزراء','created_at' => '2024-07-10 12:03:05','updated_at' => '2024-07-10 12:03:05'),
            array('id' => '45','name' => 'مدير عام الهيئة العامة للبيئة','created_at' => '2024-07-10 12:55:17','updated_at' => '2024-07-10 12:55:17'),
            array('id' => '46','name' => 'الفتوى والتشريع','created_at' => '2024-07-11 08:05:13','updated_at' => '2024-07-11 08:05:13'),
            array('id' => '47','name' => 'دار مستشارو الخليج للاستشارات الهندسية','created_at' => '2024-07-16 09:49:07','updated_at' => '2024-07-16 09:49:07'),
            array('id' => '49','name' => 'إدارة المركز الآلي لخدمات العملاء','created_at' => '2024-07-23 07:47:11','updated_at' => '2024-07-23 07:47:11'),
            array('id' => '50','name' => 'دار الدويلة للاستشارات الهندسية وادارة المشاريع','created_at' => '2024-07-24 13:07:55','updated_at' => '2025-03-06 11:53:15'),
            array('id' => '51','name' => 'إدارة مركز نظم المعلومات','created_at' => '2024-07-25 09:35:10','updated_at' => '2024-07-25 09:35:10'),
            array('id' => '52','name' => 'رئيس لجنة تخصيص المركبات','created_at' => '2024-07-25 10:21:43','updated_at' => '2024-07-25 10:21:43'),
            array('id' => '53','name' => 'SIEMENS','created_at' => '2024-07-25 10:24:02','updated_at' => '2024-07-25 10:24:02'),
            array('id' => '54','name' => 'ادارة البرامج الهندسية','created_at' => '2024-07-31 09:08:18','updated_at' => '2024-08-01 13:44:51'),
            array('id' => '55','name' => 'إدارة المشتريات','created_at' => '2024-07-31 11:07:18','updated_at' => '2024-07-31 11:07:18'),
            array('id' => '56','name' => 'إدارة تصميم الشبكات الكهربائية','created_at' => '2024-08-04 08:19:03','updated_at' => '2024-12-05 10:55:25'),
            array('id' => '57','name' => 'إدارة خدمات العملاء','created_at' => '2024-08-07 13:53:08','updated_at' => '2024-08-08 10:04:44'),
            array('id' => '58','name' => 'شركة الغانم انترناشونال للتجارة العامة والمقاولات ذ.م.م','created_at' => '2024-08-08 13:41:49','updated_at' => '2024-08-08 13:41:49'),
            array('id' => '59','name' => 'لجنة الشراء','created_at' => '2024-09-12 11:17:46','updated_at' => '2024-09-12 11:17:46'),
            array('id' => '60','name' => 'مدير إدارة الأمن والسلامة','created_at' => '2024-10-28 13:28:18','updated_at' => '2024-10-28 13:28:18'),
            array('id' => '61','name' => 'إدارة الطاقة المتجددة وكفاءة الطاقة','created_at' => '2024-11-27 09:55:04','updated_at' => '2025-07-13 12:00:49'),
            array('id' => '62','name' => 'المستشارون العرب للاستشارات الهندسية','created_at' => '2024-12-26 09:07:16','updated_at' => '2024-12-26 09:07:16'),
            array('id' => '63','name' => 'وكيل وزارة المالية','created_at' => '2025-01-22 10:04:44','updated_at' => '2025-01-22 10:04:44'),
            array('id' => '64','name' => 'شركة الوطنية للخدمات البيئية (ش.ك.م.م) WES','created_at' => '2025-01-23 11:53:40','updated_at' => '2025-01-23 11:53:40'),
            array('id' => '66','name' => 'الامين العام لمجلس الوزراء','created_at' => '2025-02-16 07:42:53','updated_at' => '2025-02-16 07:42:53'),
            array('id' => '67','name' => 'شركة المقاولون العرب الكويتية','created_at' => '2025-03-05 10:01:28','updated_at' => '2025-03-05 10:01:28'),
            array('id' => '68','name' => 'شركة محمد عبد المحسن الخرافي واولاده للتجارة العامة زالمقاولات العامة والمنشآت الصناعية','created_at' => '2025-03-10 10:41:26','updated_at' => '2025-03-10 10:41:26'),
            array('id' => '69','name' => 'شركة الخليج المتحدة للانشاء','created_at' => '2025-03-10 13:11:41','updated_at' => '2025-03-10 13:11:41'),
            array('id' => '70','name' => 'مدير إدارة المخازن','created_at' => '2025-05-05 09:48:30','updated_at' => '2025-05-05 09:48:30'),
            array('id' => '71','name' => 'الهيئة العامة للصناعة','created_at' => '2025-05-14 11:30:32','updated_at' => '2025-05-14 11:30:32'),
            array('id' => '72','name' => 'وزير الدولة لشؤون البلدية ووزير الدولة لشؤون الاسكان','created_at' => '2025-05-19 09:13:28','updated_at' => '2025-05-19 09:13:28'),
            array('id' => '73','name' => 'مدير إدارة التخطيط والمتابعة','created_at' => '2025-05-20 08:10:43','updated_at' => '2025-05-20 08:10:43'),
            array('id' => '74','name' => 'معالي وزير الكهرباء والماء والطاقة المتجددة','created_at' => '2025-05-27 08:14:42','updated_at' => '2025-05-27 08:14:42'),
            array('id' => '75','name' => 'رئيس الفريق المشكل بالقرار الإداري رقم 2024/1203','created_at' => '2025-06-22 13:03:41','updated_at' => '2025-06-22 13:03:41'),
            array('id' => '76','name' => 'لجنة ديوان المحاسبة - قرار وزاري رقم (127) لسنه 2024','created_at' => '2025-07-09 08:19:10','updated_at' => '2025-07-09 08:19:10')
          );

        Stakeholder::insert($stakeholders);
    }
}
